[
    {
        "name": "ต้มยำกุ้ง",
        "ingredients": [
            "กุ้ง 10 ตัว",
            "ยอดมะพร้าว 50 กรัม",
            "เห็ดฟาง 2 ขีด",
            "มะนาว 3 ลูก",
            "น้ำปลา 2 ช้อนโต๊ะ",
            "พริกขี้หนูสวน 3 ช้อนโต๊ะ",
            "น้ำสะอาด 3 ลิตร",
            "ตะไคร้ 2 ต้น",
            "ใบมะกรูด 3 ใบ",
            "ผักชี"
        ],
        "steps": [
            "แกะเปลือกกุ้ง มันกุ้ง และตัวกุ้งแยกกันไว้ จากนั้นผ่าหลังตัวกุ้งและเอาเส้นกลางออก แล้วล้างน้ำให้สะอาด",
            "นำมันกุ้งที่ได้มาผัดกับน้ำมันพืชเล็กน้อยจนแตกมันแล้วพักไว้",
            "นำเปลือกกุ้งมาคั่วด้วยไฟแรงพร้อมใบมะกรูดและท่อนตะไคร้ให้สุกหอม แล้วเติมน้ำลงไป ปรุงรสด้วยเกลือ ต้มจนเดือด จึงค่อยช้อนนำเปลือกกุ้งออก",
            "ใส่เนื้อกุ้งลงไป ตามด้วยเห็ดฟาง และยอดมะพร้าวแกะสลักเป็นใบไม้ เมื่อทุกอย่างเริ่มสุก เร่งไฟใส่ตะไคร้ซอย ใบมะกรูดปรุงรสด้วยน้ำปลา มันกุ้งที่ผัดเตรียมไว้ พริกขี้หนูสวนโขลกหยาบ แล้วปิดไฟ บีบมะนาว ก่อนจัดเสิร์ฟวางผักชีเพิ่มความสวยงาม"
        ],
        "image": "/image/recipe00.jpg",
        "source": "https://www.wongnai.com/recipes/old-fashioned-shrimp-tom-yum-soup",
        "path": "/recipe00.html"
    },
    {
        "name": "ต้มข่าไก่",
        "ingredients": [
            "ไก่หั่นชิ้น 150 กรัม",
            "เครื่องในไก่ 150 กรัม",
            "มะเขือเทศหั่นเสี้ยว 1 ลูก",
            "เห็ดฟางผ่าครึ่ง 7-8 ดอก",
            "เครื่องปรุงต้มข่าแบบผง 1 ซอง",
            "ตะไคร้ทุบเบาๆ หั่นเป็นท่อนๆ 1 ต้น",
            "ใบมะกรูดฉีก 3-4 ใบ",
            "พริกแห้งทอด 5 เม็ด",
            "กะทิ 1.5 ถ้วย",
            "พริกขี้หนูบุบหยาบๆ 1 ช้อนโต๊ะ",
            "น้ำมะนาว 3 ช้อนโต๊ะ",
            "น้ำปลา 2 ช้อนโต๊ะ",
            "น้ำมะขามเปียก 1 ช้อนโต๊ะ"
        ],
        "steps": [
            "นำกระทิใส่หม้อตั้งไฟ ใส่ผงปรุงรสต้มข่า ตะไคร้ ใบมะกรูด พริกแห้งทอด ปล่อยให้เดือด มีกลิ่นหอม",
            "ใส่ไก่ เครื่องในไก่ รอจนสุก",
            "ใส่มะเขือเทศ เห็ดฟาง ปรุงรสด้วยน้ำมะขามเปียก น้ำปลา ให้ออกรสเปรี้ยวๆเค็มนิดๆ",
            "ก่อนเสิร์ฟปรุงด้วยน้ำมะนาวกับพริกขี้หนูบุบหยาบๆ"
        ],
        "image": "/image/recipe01.jpg",
        "source": "https://www.wongnai.com/recipes/ugc/1c2fd2d6f1174c77bda59ea2ce37fc73",
        "path": "/recipe01.html"
    },
    {
        "name": "แกงเขียวหวาน",
        "ingredients": [
            "เนื้อไก่ 300 กรัม",
            "น้ำพริกแกงเขียวหวาน 4 ช้อนโต๊ะ",
            "มะเขือเปราะ 8 ลูก",
            "พริกชี้ฟ้าสีแดง 2 เม็ด",
            "พริกอ่อน 2 เม็ด",
            "ใบมะกรูด 8-9 ใบ",
            "ใบโหระพา 1 ถ้วย",
            "น้ำปลาดี 2 ช้อนโต๊ะ",
            "น้ำตาลปี๊บ 1 ช้อนโต๊ะ",
            "กะทิ 1 ลิตร"
        ],
        "steps": [
            "เอาหัวกะทิใส่กระทะ ตั้งไฟกลางแล้วก็ใส่น้ำพริกแกงลงไป ผัดไปเรื่อย ๆ รอให้กะทิแตกมัน",
            "ใส่เนื้อไก่ที่หั่นไว้ลงผัดกับน้ำพริกแกง ฉีกใบมะกรูดลงไปเพื่อความหอม ผัดสักพักก็ใส่หางกะทิลงไป คนให้เข้ากัน รอให้เดือด",
            "ใส่มะเขือเปราะ ตามด้วยพริกชี้ฟ้าแดงและพริกอ่อน คนให้เข้ากัน แล้วปรุงรสด้วยน้ำตาลปี๊บ น้ำปลา รอให้เดือดและมะเขือสุกดี สุดท้ายใส่ใบโหระพา"
        ],
        "image": "/image/recipe02.jpg",
        "source": "https://cooking.kapook.com/view285360.html",
        "path": "/recipe02.html"
    },
    {
        "name": "แกงพะแนง",
        "ingredients": [
            "พริกชี้ฟ้าแดงแห้งใหญ่ 5-6 เม็ด",
            "พริกขี้หนูแดงแห้งเล็ก 4 เม็ด",
            "กระเทียม 2 ช้อนโต๊ะ",
            "หอมแดง 3 ช้อนโต๊ะ",
            "ตะไคร้ซอย 4 ช้อนโต๊ะ",
            "ข่า 1 ช้อนโต๊ะ",
            "ผิวมะกรูด 1/2 ช้อนโต๊ะ",
            "กะปิ 1/3 ช้อนโต๊ะ",
            "เกลือ 1 ช้อนชา",
            "รากผักชี 1 ช้อนโต๊ะ",
            "ยี่หร่า 1 ช้อนโต๊ะ",
            "ลูกผักชี 1 ช้อนโต๊ะ",
            "ถั่วลิสง 1 ช้อนโต๊ะ",
            "สันคอหมูสไลด์ 500 กรัม",
            "พริกชี้ฟ้าแดง 2 เม็ด",
            "ใบมะกรูด 5 ใบ",
            "หัวกะทิ 500 มิลลิลิตร",
            "หางกะทิ 300 มิลลิลิตร",
            "พริกแกงพะแนง 2 ½ ช้อนโต๊ะ",
            "น้ำตาลปี๊บ 1 ½ ช้อนโต๊ะ",
            "น้ำปลา 2 ½ ช้อนโต๊ะ"
        ],
        "steps": [
            "นำพริกชี้ฟ้าแดงแห้งใหญ่ พริกขี้หนูแดงแห้งเล็ก มาหั่นเป็นชิ้นเล็ก ๆ เสร็จแล้ว แกะเอาเม็ดพริกออก แช่น้ำทิ้งไว้ ในนิ่มลง",
            "ใช้เครื่องปั่น หรือครกกับสาก ใส่ลูกผักชี ยี่หร่า ตำให้เข้ากัน จากนั้น ใส่รากผักชี ตะไคร้ ข่า ตำให้ละเอียด",
            "เสร็จแล้ว ใส่กระเทียม หอมแดง ถั่วลิสง ผิวมะกรูด แล้วใส่เกลือลงไปหยิบมือ เพื่อช่วยดูดซับน้ำจากส่วนผสม และตำได้ง่ายขึ้น",
            "นำพริกที่แช่น้ำมาบีบน้ำออก แล้วใส่ลงไป ตำให้ละเอียด",
            "ใส่กะปิลงไป ตำให้เข้ากันจนเป็นเนื้อเดียว",
            "ฉีกใบมะกรูดออก แล้วซอยเป็นเส้นเล็ก ๆ เตรียมไว้",
            "ล้างเนื้อหมูให้สะอาด จากนั้นหั่นหรือสไลด์เป็นชิ้นเล็ก ๆ พอดีคำ",
            "ตั้งกระทะใส่หัวกะทิ เปิดไฟแรง คนจนเดือดและแตกมัน",
            "ใส่พริกแกงพะแนงลงไป ผัดให้เข้ากัน",
            "ใส่เนื้อหมู เติมหางกะทิ ปรุงรสด้วยน้ำตาลโตนดและน้ำปลา",
            "โรยใบมะกรูดซอยและพริกชี้ฟ้าแดงซอย"
        ],
        "image": "/image/recipe03.jpg",
        "source": "https://recipe.sgethai.com/recipes/panang-curry-with-pork/",
        "path": "/recipe03.html"
    },
    {
        "name": "แกงส้มชะอมกุ้ง",
        "ingredients": [
            "ไข่ไก่ 2 ฟอง",
            "ชะอมเด็ดเป็นใบ 1 ถ้วย",
            "น้ำพริกแกงส้ม 1/2 ถ้วย",
            "หอมแดง 5 หัว",
            "กระชาย 100 กรัม",
            "ปลาทูน่ากระป๋อง 1 กระป๋อง",
            "น้ำเปล่า 5 ถ้วย",
            "น้ำปลา 5 ช้อนโต๊ะ",
            "เกลือทะเล 1 ช้อนชา",
            "น้ำตาลปี๊บ 1 ช้อนโต๊ะ",
            "น้ำมะขามเปียก 1 ถ้วย",
            "กุ้งสด 10 ตัว",
            "น้ำมันพืชสำหรับทอดไข่เจียว"
        ],
        "steps": [
            "ตีไข่ไก่พอแตก ใส่ชะอมเด็ดลงไป ปรุงรสด้วยน้ำปลาเล็กน้อย",
            "ใส่น้ำมันพืชลงในกระทะ พอร้อนใส่ไข่ลงไปทอดจนสุก ตักขึ้นสะเด็ดน้ำมัน หั่นเป็นชิ้น ๆ",
            "โขลกน้ำพริกแกงส้ม หอมแดง และเนื้อปลาทูน่าให้ละเอียด",
            "ใส่น้ำเปล่าลงในหม้อ ตักน้ำพริกแกงส้มลงไปคนให้ละลาย ต้มจนเดือด ปรุงรสด้วยน้ำปลา เกลือ น้ำตาลปี๊บ และน้ำมะขามเปียก",
            "ใส่กุ้งสดลงไปต้มพอสุก ปิดไฟ ตักราดบนไข่ชะอม"
        ],
        "image": "/image/recipe04.jpg",
        "source": "https://recipe.sgethai.com/recipes/shrimp-sour-soup-with-acacia/",
        "path": "/recipe04.html"
    },
    {
        "name": "ผัดกะเพรา",
        "ingredients": [
            "น้ำมันรำข้าว 1 ช้อนโต๊ะ",
            "กระเทียมสับ 1 ช้อนโต๊ะ",
            "พริกแดงตำ ตามชอบ",
            "หมูบด 2 ขีด",
            "น้ำเล็กน้อย",
            "ซอสหอยนางรม 1 ช้อนครึ่ง",
            "น้ำปลา 1 ช้อนโต๊ะ",
            "น้ำตาลทราย 1 ช้อนชา",
            "ใบกะเพรา ตามชอบ"
        ],
        "steps": [
            "เทน้ำมันลงในกระทะตามด้วยกระเทียมสับพริกแดงตำ ผัดจนมีกลิ่นหอม",
            "ใส่หมูบดผัดจนหมูสุก ใส่น้ำเล็กน้อย ปรุงรสด้วยซอสหอยนางรม น้ำปลา และน้ำตาลทราย ผัดให้เข้ากัน",
            "ปิดไฟใส่ใบกะเพรา ตักใส่จาน"
        ],
        "image": "/image/recipe05.jpg",
        "source": "https://www.wongnai.com/recipes/ugc/c1e3ed7ad25c4c509bc17ded10674ce7",
        "path": "/recipe05.html"
    }
]